09-objects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-24 Wed 13:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Objects</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="highlight/styles/vs2015.css">
</head>
<body>
<div id="content">
<h1 class="title">Objects</h1>
<p>
<b><a href="index.html">Home</a></b>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org02b708b">1. Objects</a>
<ul>
<li><a href="#orgac45480">1.1. Creating</a></li>
<li><a href="#org6c450bd">1.2. Accessing property values</a></li>
<li><a href="#orgaf57488">1.3. Updating properties</a></li>
<li><a href="#org7e8a027">1.4. Functions</a></li>
</ul>
</li>
<li><a href="#org8fe2590">2. Exercises</a></li>
</ul>
</div>
</div>

<div id="outline-container-org02b708b" class="outline-2">
<h2 id="org02b708b"><span class="section-number-2">1</span> Objects</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Objects</b> are values useful for grouping pieces of information together. When it comes to representing real-world information in code, we often have pieces of information that are intuitively grouped together. For example, a person has a name, favorite color, and favorite food. How can we group this information about one person together, using the tools we have so far? One option would be to create separate variable for each value.
</p>

<div class="org-src-container">
<pre class="src src-js">const personName = 'Alice';
const favoriteColor = 'red';
const favoriteFood = 'sushi';

console.log(`${personName}'s favorite color is ${favoriteColor} and favorite food is ${favoriteFood}.`);
</pre>
</div>

<p>
This works fine for such a trivial example, but what about when we want to pass this information to a function, particularly one that expects information about two people?
</p>

<div class="org-src-container">
<pre class="src src-js">const coupleDining = (name1, color1, food1, name2, color2, food2) =&gt; {
  console.log(`${name1} and ${name2} would enjoy a meal consisting of ${food1} and ${food2} in a ${color1} and ${color2} room.`);
};

coupleDining('Alice', 'red', 'sushi', 'Bob', 'grey', 'bread');
</pre>
</div>

<p>
This works, but it's different from how we think about the problem. We want this function to take 2 person arguments and say something about their information, but we're passing it 6 arguments. An option to get around this issue is to involve arrays.
</p>

<div class="org-src-container">
<pre class="src src-js">// Using indexing
const coupleDining = (person1, person2) =&gt; {
  console.log(`${person1[0]} and ${person2[0]} would enjoy a meal consisting of ${person1[2]} and ${person2[2]} in a ${person1[1]} and ${person2[1]} room.`);
};

coupleDining(['Alice', 'red', 'sushi'], ['Bob', 'grey', 'bread']);

// Using array destructuring
const coupleDiningAlternate = ([name1, color1, food1], [name2, color2, food2]) =&gt; {
  console.log(`${name1} and ${name2} would enjoy a meal consisting of ${food1} and ${food2} in a ${color1} and ${color2} room.`);
};

coupleDiningAlternate(['Alice', 'red', 'sushi'], ['Bob', 'grey', 'bread']);
</pre>
</div>

<p>
This is a bit better, since we are now grouping the information of each person thus passing only 2 arguments, each representing one person. However, in either case we have to keep track of the order of the information in a person array (the first value is the name, second is color, and third is food). We either use array destructuring for descriptive variable names, or give names to the arrays themselves and use careful indexing. Neither option is ideal. Fortunately, this is where <b>objects</b> can help.
</p>

<div class="org-src-container">
<pre class="src src-js">const coupleDining = (person1, person2) =&gt; {
  console.log(`${person1.name} and ${person2.name} would enjoy a meal consisting of ${person1.favoriteFood} and ${person2.favoriteFood} in a ${person1.favoriteColor} and ${person2.favoriteColor} room.`);
};

coupleDining(
  {name: 'Alice', favoriteColor: 'red', favoriteFood: 'sushi'},
  {name: 'Bob', favoriteFood: 'bread', favoriteColor: 'grey'}
);
</pre>
</div>

<p>
Now our code reads more clearly! Each person has named properties and the order of those properties doesn't matter.
</p>
</div>

<div id="outline-container-orgac45480" class="outline-3">
<h3 id="orgac45480"><span class="section-number-3">1.1</span> Creating</h3>
<div class="outline-text-3" id="text-1-1">
<p>
An object is comprised of <b>key-value pairs</b>. The keys are strings and their corresponding values can be any type (even objects!). Each key-value pair represents a property of the object. In a single line, an object representing a store product could look like this: <code>{name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'}</code>. Bigger objects are more pleasant to look at when written on multiple lines:
</p>

<div class="org-src-container">
<pre class="src src-js">{
  name: 'Marvin',
  age: 8,
  species: 'cat',
  colors: ['black', 'white'],
  sex: 'female',
  friendly: true
}
</pre>
</div>

<p>
Syntactically, curly brackets enclose the entire object. Inside, we have key-value pairs separated by commas. In each key-value pair, the key and value are separated by a colon (keys on the left, values on the right). The keys don't need to have quotation marks like typical strings because they are <i>always</i> strings.
</p>

<p>
An object printed in the console sometimes looks slightly different than the same object in your code, but rest assured that if the general structure and syntax are the same, there is no logical difference.
</p>

<div class="org-src-container">
<pre class="src src-js">console.log({name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'});

const myCat = {
  name: 'Marvin',
  age: 8,
  species: 'cat',
  colors: ['black', 'white'],
  sex: 'female',
  friendly: true
};
console.log(myCat);
</pre>
</div>

<p>
If we have any key names inside of variables, we must use square brackets to use them.
</p>

<div class="org-src-container">
<pre class="src src-js">const key1 = 'name';
const value1 = 'Marvin';
const key2 = 'age';
const value2 = 8;

const myCat = {
  [key1]: value1,
  [key2]: value2,
  species: 'cat',
  colors: ['black', 'white'],
  sex: 'female',
  friendly: true
};
console.log(myCat);
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c450bd" class="outline-3">
<h3 id="org6c450bd"><span class="section-number-3">1.2</span> Accessing property values</h3>
<div class="outline-text-3" id="text-1-2">
<p>
There are three ways to access the values of an object's properties.
</p>
</div>

<div id="outline-container-org7489112" class="outline-4">
<h4 id="org7489112"><span class="section-number-4">1.2.1</span> Dot notation</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Dot notation is most similar to plain English. If <code>product</code> holds an object with a name property, we can use <code>product.name</code> to access the product's name.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};

console.log(product.name); // Spirit Island Board Game
console.log(product.price); // 95.95
console.log(product.brand); // Greater Than Games
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e5c7b6" class="outline-4">
<h4 id="org2e5c7b6"><span class="section-number-4">1.2.2</span> Square bracket notation</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Using square brackets is similar to using index numbers with arrays.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};

console.log(product['name']); // Spirit Island Board Game
console.log(product['price']); // 95.95
console.log(product['brand']); // Greater Than Games
</pre>
</div>

<p>
This may seem like unnecessary syntax when we have the dot notation at our disposal. However, we <i>must</i> use square bracket notation when the key itself is stored a variable.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};
const n = 'name';
const p = 'price';
const b = 'brand';

console.log(product[n]); // Spirit Island Board Game
console.log(product[p]); // 95.95
console.log(product[b]); // Greater Than Games

console.log(product.b); // undefined -- this tries to use a key named 'b' of product, not the variable b
</pre>
</div>
</div>
</div>

<div id="outline-container-org03c1374" class="outline-4">
<h4 id="org03c1374"><span class="section-number-4">1.2.3</span> Destructuring</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Sometimes we don't want to give an object a name, but rather go straight to its properties. Destructuring allows us to create variables whose names are the exact names of keys of a given object.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};

const {name, price, brand} = product; // Destructuring happens on the left

console.log(name); // Spirit Island Board Game
console.log(price); // 95.95
console.log(brand); // Greater Than Games
</pre>
</div>

<p>
Notice that the destructuring looks like the same shape as the object, but without the values.
</p>

<p>
This can come in handy when we're not interested in all the properties of an object.
</p>

<div class="org-src-container">
<pre class="src src-js">const myCat = {
  name: 'Marvin',
  age: 8,
  species: 'cat',
  colors: ['black', 'white'],
  sex: 'female', friendly: true
};

// Destructuring in the arguments
const describeAnimal = ({name, species, colors}) =&gt; {
  const colorString = colors.join(' and ');
  console.log(`${name} is a ${colorString} ${species}.`);
};

describeAnimal(myCat);
</pre>
</div>

<p>
In the end, dot notation and object destructuring are simply shortcuts. We could do all we need with square bracket notation. Choosing between the three comes down to personal preference in any scenario.
</p>
</div>
</div>
</div>

<div id="outline-container-orgaf57488" class="outline-3">
<h3 id="orgaf57488"><span class="section-number-3">1.3</span> Updating properties</h3>
<div class="outline-text-3" id="text-1-3">
<p>
When we need to update a property's value in an object, we can make a copy of the object and change only what we need to.
</p>

<p>
To copy an object, we can use the <b>spread</b> operator: <code>...</code>.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};
const productCopy = {...product};

console.log(product); // (the original)
console.log(productCopy); // (an exact copy)
</pre>
</div>

<p>
This spreads out all of the object's key-value pairs into a new object.
</p>

<p>
Let's lower the price of our product object.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};
const productSale = {...product, price: 47.97};

console.log(product); // (the original)
console.log(productSale); // (the product on sale)
</pre>
</div>

<p>
It's important that the <i>spread comes first</i> in the updated object, otherwise our desired change will be overridden.
</p>

<p>
We can update as many properties as we want in a single operation, even adding new properties.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};
const newProduct = {...product, price: 79.95, name: 'Spirit Island', stock: 9};

console.log(product); // (the original)
console.log(newProduct); // (changed the price and name, and added stock)
</pre>
</div>

<p>
Changing a value based on its previous value is common too.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games', stock: 9};
const moreProduct = {...product, stock: product.stock + 1};

console.log(product); // (the original)
console.log(moreProduct); // (increased stock by 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e8a027" class="outline-3">
<h3 id="org7e8a027"><span class="section-number-3">1.4</span> Functions</h3>
<div class="outline-text-3" id="text-1-4">
<p>
There are a few very useful functions for dealing with objects. Each of the following functions take an object and return an array. After all, we have plenty of ways of dealing with arrays.
</p>
</div>

<div id="outline-container-orga9afaba" class="outline-4">
<h4 id="orga9afaba"><span class="section-number-4">1.4.1</span> Object.keys()</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Get the keys of an object.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};

console.log(Object.keys(product)); // [ 'name', 'price', 'brand' ]
</pre>
</div>
</div>
</div>

<div id="outline-container-org6676a10" class="outline-4">
<h4 id="org6676a10"><span class="section-number-4">1.4.2</span> Object.values()</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Get the values of an object.
</p>

<div class="org-src-container">
<pre class="src src-js">const product = {name: 'Spirit Island Board Game', price: 95.95, brand: 'Greater Than Games'};

console.log(Object.values(product)); // [ 'Spirit Island Board Game', 95.95, 'Greater Than Games' ]
</pre>
</div>
</div>
</div>

<div id="outline-container-org411edf6" class="outline-4">
<h4 id="org411edf6"><span class="section-number-4">1.4.3</span> Object.entries()</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Get the key-value pairs of an object. Returns an array of pairs (each pair is an array of two elements).
</p>

<div class="org-src-container">
<pre class="src src-js">const obj = {a: 1, b: 2, c: 3};

console.log(Object.entries(obj)); // [ [ 'a', 1 ], [ 'b', 2 ], [ 'c', 3 ] ]
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org8fe2590" class="outline-2">
<h2 id="org8fe2590"><span class="section-number-2">2</span> Exercises</h2>
<div class="outline-text-2" id="text-2">
<ul>
	<li><a href="09-objects-exercises.js">View exercises</a></li>
	<li><a href="09-objects-exercises.js" download type="application/octet-stream">Download exercises</a></li>
	<li><a href="09-objects-solutions.js">View solutions</a></li>
	<li><a href="09-objects-solutions.js" download type="application/octet-stream">Download solutions</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
